In [ ]:
"""
This notebook will be exploring the distribution of vehicles traveling the BQE pre/post Weigh In Motion Enforcement.
We seek to determine if there was a statistically significant change in the volume of traffic/ type of traffic traversing the BQE.
"""

In [3]:
import pandas as pd

Seperating Pre-Enforcement and Post-Enforcement Data

In [ ]:
#Queens Bound , 2019 - 2023
df = pd.read_csv("./Data/Daily_Vehicle_Count/QB_daily_vehicle_count_19_23.csv")

In [79]:
#Applying function to each row to create new column from year, month, day with format YYYYMMDD for the purpose of ordering data
def create_year_month_day(row):
    return f"{row['year']}{row['month']:02d}{row['day']:02d}"

df['year_month_day'] = df.apply(create_year_month_day, axis=1)

df

      direction  year  month  day  class  class_count year_month_day
0            QB    23      1   27     13           34         230127
1            QB    23      8   24     14          119         230824
2            QB    23      3   20      6          763         230320
3            QB    23     12   11      5         3107         231211
4            QB    23     10   25      4          227         231025
...         ...   ...    ...  ...    ...          ...            ...
18004        QB    19     11   14     12            1         191114
18005        QB    19     12   17     12            3         191217
18006        QB    19     10   19     12            1         191019
18007        QB    19     12   26     12            2         191226
18008        QB    19     11   24     12            1         191124

[18009 rows x 7 columns]

In [80]:
df["year_month_day"] = df["year_month_day"].astype(int)
df = df.sort_values("year_month_day", ascending=True)
# Queens Bound WIM enforcement began Novemeber 13, 2023

df = df.reset_index(drop=True)

In [81]:
pre_enforcement_df1 = df[df["year_month_day"] < 231113]
post_enforcement_df1 = df[df["year_month_day"] >= 231113]

In [82]:
pre_enforcement_df1 #QB Daily Traffic Count Pre-enforcement 2019 - 2023

      direction  year  month  day  class  class_count  year_month_day
0            QB    19     10   16      5         1969          191016
1            QB    19     10   16     12            2          191016
2            QB    19     10   16     13            7          191016
3            QB    19     10   16      9         1866          191016
4            QB    19     10   16      3         7056          191016
...         ...   ...    ...  ...    ...          ...             ...
17353        QB    23     11   12      3         4261          231112
17354        QB    23     11   12      9          487          231112
17355        QB    23     11   12      6           90          231112
17356        QB    23     11   12      5         1032          231112
17357        QB    23     11   12      7           26          231112

[17358 rows x 7 columns]

In [83]:
post_enforcement_df1 #QB Daily Traffic Count Post-enforcement 2019 - 2023

      direction  year  month  day  class  class_count  year_month_day
17358        QB    23     11   13      4          208          231113
17359        QB    23     11   13     11           20          231113
17360        QB    23     11   13      9         1554          231113
17361        QB    23     11   13      2        33659          231113
17362        QB    23     11   13      6          713          231113
...         ...   ...    ...  ...    ...          ...             ...
18004        QB    23     12   31      4          131          231231
18005        QB    23     12   31      3         3514          231231
18006        QB    23     12   31      5          866          231231
18007        QB    23     12   31      8           49          231231
18008        QB    23     12   31      6           66          231231

[651 rows x 7 columns]

In [ ]:
df2 = pd.read_csv("./Data/Daily_Vehicle_Count/QB_daily_vehicle_count_24_25.csv")

df2

     direction  year  month  day  class  class_count
0           QB    24      6   11      2        30297
1           QB    24      2   15      3         6536
2           QB    24      3   17      3         3864
3           QB    24      2   26      6          644
4           QB    24      4   25      4          366
...        ...   ...    ...  ...    ...          ...
5772        QB    25      1   16     13            1
5773        QB    25      2    2     14            1
5774        QB    25      1   30     14            1
5775        QB    25      3   26     14            2
5776        QB    25      1   12     12            5

[5777 rows x 6 columns]

In [84]:
df2['year_month_day'] = df2.apply(create_year_month_day, axis=1)

df2

     direction  year  month  day  class  class_count year_month_day
1846        QB    24      1    1      1           38         240101
4823        QB    24      1    1     14            7         240101
849         QB    24      1    1      7            8         240101
194         QB    24      1    1      5          797         240101
555         QB    24      1    1     12            9         240101
...        ...   ...    ...  ...    ...          ...            ...
5076        QB    25      3   31      9          711         250331
5018        QB    25      3   31      8           87         250331
5069        QB    25      3   31     11            9         250331
4889        QB    25      3   31      3         2016         250331
4973        QB    25      3   31      5         1872         250331

[5777 rows x 7 columns]

In [88]:
df2["year_month_day"] = df2["year_month_day"].astype(int)
df2 = df2.sort_values("year_month_day", ascending=True)
df2 = df2.reset_index(drop=True)

In [89]:
df2

     direction  year  month  day  class  class_count  year_month_day
0           QB    24      1    1      1           38          240101
1           QB    24      1    1     14            7          240101
2           QB    24      1    1      7            8          240101
3           QB    24      1    1      5          797          240101
4           QB    24      1    1     12            9          240101
...        ...   ...    ...  ...    ...          ...             ...
5772        QB    25      3   31      9          711          250331
5773        QB    25      3   31      8           87          250331
5774        QB    25      3   31     11            9          250331
5775        QB    25      3   31      3         2016          250331
5776        QB    25      3   31      5         1872          250331

[5777 rows x 7 columns]

In [ ]:
post_enforcement_df2 = pd.concat([post_enforcement_df1,df2], axis=0) 
#Joining Historical and Current Data to form comprehensive post-enforcement df for daily vehicle count QB.

post_enforcement_df2 = post_enforcement_df2.reset_index(drop=True)

post_enforcement_df2

     direction  year  month  day  class  class_count  year_month_day
0           QB    23     11   13      4          208          231113
1           QB    23     11   13     11           20          231113
2           QB    23     11   13      9         1554          231113
3           QB    23     11   13      2        33659          231113
4           QB    23     11   13      6          713          231113
...        ...   ...    ...  ...    ...          ...             ...
6423        QB    25      3   31      9          711          250331
6424        QB    25      3   31      8           87          250331
6425        QB    25      3   31     11            9          250331
6426        QB    25      3   31      3         2016          250331
6427        QB    25      3   31      5         1872          250331

[6428 rows x 7 columns]

In [92]:
pre_enforcement_df1.to_csv("QB_pre_enforcement.csv", index=False)

post_enforcement_df2.to_csv("QB_post_enforcement.csv", index=False)

Pre-enforcement SI bound Data

In [93]:
df3 = pd.read_csv("./Data/Daily_Vehicle_Count/SIB_daily_vehicle_count_19_23.csv")

df3

     direction  year  month  day  class  class_count
0          SIB    20      5   10      2        34801
1          SIB    20      1   12      2        57089
2          SIB    20      4   26      2        24158
3          SIB    20      7   29      3         8089
4          SIB    20      7   16      2        40987
...        ...   ...    ...  ...    ...          ...
5685       SIB    19     11    3      7            2
5686       SIB    19     11   24     13            1
5687       SIB    19     11   30     12            1
5688       SIB    19     12   29     12            1
5689       SIB    19     10   20     13            1

[5690 rows x 6 columns]

In [94]:
df3['year_month_day'] = df3.apply(create_year_month_day, axis=1)

df3

     direction  year  month  day  class  class_count year_month_day
0          SIB    20      5   10      2        34801         200510
1          SIB    20      1   12      2        57089         200112
2          SIB    20      4   26      2        24158         200426
3          SIB    20      7   29      3         8089         200729
4          SIB    20      7   16      2        40987         200716
...        ...   ...    ...  ...    ...          ...            ...
5685       SIB    19     11    3      7            2         191103
5686       SIB    19     11   24     13            1         191124
5687       SIB    19     11   30     12            1         191130
5688       SIB    19     12   29     12            1         191229
5689       SIB    19     10   20     13            1         191020

[5690 rows x 7 columns]

In [95]:
df3["year_month_day"] = df3["year_month_day"].astype(int)
df3 = df3.sort_values("year_month_day", ascending=True)
df3 = df3.reset_index(drop=True)

df3

     direction  year  month  day  class  class_count  year_month_day
0          SIB    19     10   11     12          269          191011
1          SIB    19     10   11     14         7943          191011
2          SIB    19     10   11      5         1719          191011
3          SIB    19     10   11      6          798          191011
4          SIB    19     10   11      1         2755          191011
...        ...   ...    ...  ...    ...          ...             ...
5685       SIB    20     12   31      8           72          201231
5686       SIB    20     12   31      7           13          201231
5687       SIB    20     12   31     11            2          201231
5688       SIB    20     12   31      3         3394          201231
5689       SIB    20     12   31      5          262          201231

[5690 rows x 7 columns]

In [96]:
df3.to_csv("./Data/Pre_Post_Enforcement/SIB_pre_enforcement.csv", index=False)